const { default: LayoutOne } = require("@/Layout/LayoutOne");

const PrivacyPolicy = () => {
  const containerStyle = {
    fontFamily: "Arial, sans-serif",
    margin: "20px",
    lineHeight: "1.6",
    padding: '20px'
  };

  const sectionStyle = {
    marginBottom: "20px",
  };

  const headingStyle = {
    fontSize: "18px",
    fontWeight: "bold",
    marginBottom: "10px",
  };

  const paragraphStyle = {
    fontSize: "14px",
    marginBottom: "10px",
  };

  return (
    <div className="postDetails__area">
      <LayoutOne>
        <div style={containerStyle}>
          <div style={sectionStyle}>
            <h2 style={headingStyle}>আমাদের গোপনীয়তা নীতি</h2>
            <p style={paragraphStyle}>
            আমরা, জোবায়ের একাডেমি, 1994 সালের বাংলাদেশী কোম্পানি আইন (অ্যাক্ট XVIII) এর অধীনে নিগমিত (এখন থেকে &quot;কোম্পানি&quot; বা &quot;জোবায়ের একাডেমি&quot; হিসাবে উল্লেখ করা হয়েছে), ইনকর্পোরেশন নম্বর C162578 / 2020 সহ, আপনার ব্যক্তিগত তথ্যের সুরক্ষার ক্ষেত্রে আপনার গোপনীয়তা রক্ষা করতে প্রতিশ্রুতিবদ্ধ। পরিষেবাগুলি এই নীতি এবং আপনার জন্য প্রযোজ্য প্ল্যাটফর্মে প্রকাশিত অন্য কোনও নিয়ম, নীতি বা নির্দেশিকা দ্বারা পরিচালিত হয়৷

আমাদের প্ল্যাটফর্ম অ্যাক্সেস করার এবং পরিষেবাগুলি ব্যবহার করার আগে দয়া করে এই নীতিটি সাবধানে পড়ুন৷ প্ল্যাটফর্ম অ্যাক্সেস এবং ব্যবহার করে, আপনার ব্যক্তিগত তথ্য প্রদান করে (নীচে সংজ্ঞায়িত করা হয়েছে), অথবা বিকল্প আপনার কাছে উপস্থাপিত হলে অন্যথায় আপনার চুক্তির সম্মতি দিয়ে, আপনি এই নীতিতে বর্ণিত তথ্য সংগ্রহ, ব্যবহার, প্রকাশ, ভাগ করা এবং সংরক্ষণে সম্মত হন, পরিষেবার শর্তাবলী এবং আপনার জন্য প্রযোজ্য প্ল্যাটফর্মে প্রকাশিত অন্য কোন নিয়ম, নীতি বা নির্দেশিকা (একত্রে &quot;প্ল্যাটফর্ম শর্তাবলী&quot; হিসাবে উল্লেখ করা হয়), এবং জোবায়ের একাডেমি থেকে উদ্ভূত সমস্ত দায় অস্বীকার করে। এই নীতির বিবৃতিগুলি পড়ার আগে আপনি যদি অসাবধানতাবশত জোবায়ের একাডেমি এর কাছে কোনও ব্যক্তিগত তথ্য জমা দিয়ে থাকেন, অথবা আপনার ব্যক্তিগত তথ্য যেভাবে সংগ্রহ করা, সংরক্ষণ করা বা ব্যবহার করা হয় তার সাথে আপনি একমত না হন, তাহলে আপনি অ্যাক্সেস, পরিবর্তন এবং/ অথবা এই নীতি অনুসারে আপনার ব্যক্তিগত তথ্য মুছে ফেলুন।

প্ল্যাটফর্মে আপনার দেওয়া বা আপলোড করা কোনো তথ্য যদি প্ল্যাটফর্মের শর্তাবলী লঙ্ঘন করে, তাহলে জোবায়ের একাডেমিকে সেই তথ্যটি আপনাকে জানানোর পরে মুছে ফেলার প্রয়োজন হতে পারে এবং প্রয়োজনে প্ল্যাটফর্মে আপনার অ্যাক্সেস প্রত্যাহার করতে হবে। এই নীতি সম্পর্কে আপনার কোন প্রশ্ন থাকলে, অনুগ্রহ করে আমাদের সাথে যোগাযোগ করুন 

contact@jobayeracademy.com.
            </p>

          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>যে সকল তথ্য আমরা সংগ্রহ করি</h3>
            <p style={paragraphStyle}>
            আপনি যখন আমাদের ওয়েবসাইট ভিজিট করেন বা আমাদের পরিষেবাগুলি ব্যবহার করেন তখন আমরা আপনার সম্পর্কে তথ্য সংগ্রহ করি। এতে আপনার নাম, ইমেল ঠিকানা, ফোন নম্বর এবং ঠিকানার মতো ব্যক্তিগত তথ্য অন্তর্ভুক্ত থাকতে পারে। আমরা আপনার ব্রাউজিং আচরণ, অবস্থান ডেটা এবং ডিভাইসের তথ্য সম্পর্কে তথ্য সংগ্রহ করতে পারি।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>আমরা কিভাবে আপনার তথ্য ব্যবহার করি?</h3>
            <p style={paragraphStyle}>
            আমরা বিভিন্ন উদ্দেশ্যে আপনার তথ্য ব্যবহার করি, যার মধ্যে আমাদের পণ্য এবং পরিষেবাগুলি আপনাকে সরবরাহ করা, আপনার সাথে যোগাযোগ করা, আপনার অর্ডারগুলি প্রক্রিয়া করা এবং আমাদের ওয়েবসাইট এবং পরিষেবাগুলিকে উন্নত করা সহ। আমরা আপনার তথ্য বিপণন এবং বিজ্ঞাপনের উদ্দেশ্যে ব্যবহার করতে পারি।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>আপনার তথ্য শেয়ারিং</h3>
            <p style={paragraphStyle}>
              আমরা আমাদের সহযোগী, পরিষেবা প্রদানকারী এবং ব্যবসায়িক অংশীদারদের সাথে আপনার তথ্য শেয়ার করতে পারি। আমরা
              আপনার তথ্য শেয়ার করতে পারি যদি আমাদের আইন দ্বারা তা করার প্রয়োজন হয়, অথবা যদি আমরা বিশ্বাস করি যে আমাদের
              অধিকার, সম্পত্তি বা সুরক্ষার জন্য এই ধরনের পদক্ষেপ প্রয়োজন।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>আপনার পছন্দ</h3>
            <p style={paragraphStyle}>
              আপনার তথ্য কিভাবে ব্যবহার করা হবে তা নিয়ন্ত্রণ করার অধিকার আপনার আছে। আপনি যেকোনো সময় আমাদের সাথে এ বিষয়ে
              আলোচনা করতে পারেন৷ আপনি অনুরোধ করতে পারেন যে আমরা আমাদের রেকর্ড থেকে আপনার তথ্য মুছে ফেলি।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>কুকিজ এবং অনুরূপ প্রযুক্তি</h3>
            <p style={paragraphStyle}>
            আমরা আমাদের ওয়েবসাইটের আপনার ব্যবহার সম্পর্কে তথ্য সংগ্রহ করতে কুকিজ এবং অনুরূপ প্রযুক্তি ব্যবহার করি। এই প্রযুক্তিগুলি আমাদের আপনার অভিজ্ঞতাকে ব্যক্তিগতকৃত করতে এবং আমাদের ওয়েবসাইট এবং পরিষেবাগুলিকে উন্নত করতে সহায়তা করে৷ আপনি আপনার ব্রাউজার সেটিংস থেকে কুকিজ কিভাবে ব্যবহার করা হয় তা নিয়ন্ত্রণ করতে পারেন।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>নিরাপত্তা</h3>
            <p style={paragraphStyle}>
            আমরা আপনার তথ্যের নিরাপত্তাকে গুরুত্ব সহকারে নিই এবং এটিকে অননুমোদিত অ্যাক্সেস, ব্যবহার বা প্রকাশ থেকে রক্ষা করার জন্য ব্যবস্থা গ্রহণ করি। যাইহোক, কোন সিস্টেম সম্পূর্ণ নিরাপদ হতে পারে না, তাই আমরা আপনার তথ্যের নিরাপত্তার নিশ্চয়তা দিতে পারি না।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>এই নীতি পরিবর্তন</h3>
            <p style={paragraphStyle}>
            আমরা সময়ে সময়ে এই গোপনীয়তা নীতি আপডেট করতে পারি। আমরা আমাদের ওয়েবসাইটে নতুন প্রাইভেসি পলিসি পোস্ট করে কোনো পরিবর্তন সম্পর্কে আপনাকে অবহিত করব। এই নীতিতে কোনো পরিবর্তনের পরে আমাদের ওয়েবসাইট এবং পরিষেবাগুলির আপনার ক্রমাগত ব্যবহার সেই পরিবর্তনগুলির স্বীকৃতি হিসাবে বিবেচিত হবে।
            </p>
          </div>
          <div style={sectionStyle}>
            <h3 style={headingStyle}>যোগাযোগ</h3>
            <p style={paragraphStyle}>
              এই নীতি সম্পর্কে আপনার কোন প্রশ্ন থাকলে, অনুগ্রহ করে আমাদের সাথে যোগাযোগ করুন:{" "}
              <a href="mailto:contact@jobayeracademy.com">contact@jobayeracademy.com</a>.
            </p>
          </div>
        </div>
      </LayoutOne>
    </div>
  );
};

export default PrivacyPolicy;
